Revit 2027 API
BuiltInFailures.CreationFailures.CannotUpdateWall Property
 Can't update Wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotUpdateWall { get; }
Public Shared ReadOnly Property CannotUpdateWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotUpdateWall {
	FailureDefinitionId^ get ();
}
static member CannotUpdateWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace